Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་དག་ ནམ་མཁའ་ བཞིན་ དུ་ གོས་པ་ མེད་ ཆོས་ རྣམས །_། ཆོས་ འདིར་ དགེ་སྦྱོང་ གང་དག་ ལེགས་པ ར་ བསླབས་ རྣམས་ དང་ །_། གཞན་དག་ སློབ་པ་ རྣམས་ དང་ སློབ་པ ར་ འགྱུར་བ་ རྣམས །_། འདི་ ལ་ ནམ་ དུའང་ གང་དག་ འཆགས་པ ར་ མི་འགྱུར་བ །_། ང་ ཡིས་ དེ་དག་ དགེ་སྦྱོང་ ལེགས་ བསླབས་ རྣམས་ སུ་ བསྟན །_།
en: Like space, they cannot be tarnished by anything. |#| $38 “Mendicants who train well in this Dharma, While also showing others the points of training, Will never develop attachments. |#| These I declare to be well-trained mendicants.

source: ཇི་ལྟ ར་ མཁའ་ ལ་ ནམ་ཡང་ ལག་པ་ མི་ ཐོགས་ དང་ །_། རྡུལ་ དང་ དུ་བ་ རྣམས་ ཀྱིས་ གོས་པ ར་ མི་ འགྱུར་ དང་ །_། ཇི་ལྟ ར་ ལམ་ ནི་ ནམ་ཡང་ བྱེད་པ ར་ མི་འགྱུར་བ །_། ཆོས་ ལ་ དེ་བཞིན་ མོས་པ་ རྣམས་ ནི་ དགེ་སྦྱོང་ ཡིན །_།
en: $39 “Just as space cannot be blocked by the hand, Nor sullied by dust or smoke, And just as its path cannot be altered, So are mendicants who trust the Dharma accordingly.#10

source: ཇི་ལྟ ར་ སྤྲིན་ དང་ བྲལ་བ ར་ གྱུར་པ འི་ ནམ་མཁའ་ ལ །_། ཟླ་བ་ ཐོགས་པ་ མེད་པར་ མཁའ་ ལ་ འགྲོ་བྱེད་ ཀྱང་ །_། བདག་ གིས་ བར་སྣང་ ལ་ ནི་ སྣང་བར་ བྱ་ སྙམ་ དུ །_། དེ་ ལ་ རྣམ་རྟོག་ དེ་ ནི་ འབྱུང་བ ར་ མི་ འགྱུར་ བཞིན །_། རྒོད་ མེད་ བདག་ཉིད་ དགེ་སློང་ ཟླ་བ་ ལྟ་བུ་ ཡིས །_། སྦྱིན་པ འི་ བདག་པོ འི་ ཁྱིམ་ རྣམས་ སུ་ ནི་ འགྲོ་བ ར་ བྱ །_། |#| རྒོད་ མེད་ ང་རྒྱལ་ རྣམ་གྲོལ་ སེམས་ དང་ ལྡན་པ་ དང་ །_། འཇིག་རྟེན་ ཆོས་ རྣམས་ ཀྱིས་ ནི་ མ་ གོས་ སེམས་ ལྡན་ བྱ །_།
en: $40 “Across the cloudless sky The moon travels unhindered, Yet it does so without thinking, ‘I shall illumine this space.’ |#| $41 “Likewise, when, free from agitation, moon-like mendicants Visit the households of benefactors Their minds should be liberated, free from excitement and pride, And unstained by any mundane phenomenon.

source: ཁྱིམ་ རྣམས་ ལ་ ནི་ ང་རྒྱལ་ སྤངས་ ནས་ བསྟེན་པ ར་ བྱ །_།
en: $42 “Having abandoned pride they thus visit the households, And

source: དེར་ ཕྱིན་ ནས་ ཀྱང་ ཆོས་ཉིད་ རབ་ཏུ་ བརྗོད་པ ར་ བྱ །_།
en: once there they speak the Dharma.

source: བདེ་ དང་ རྙེད་པ འི་ ཕྱིར་ ནི་ འདོད་པ འང་ སྤངས་ ནས་ སུ །_། འཇིག་རྟེན་ [9a] རྣམ་དག་ ཚུལ་ཁྲིམས་ ཅན་ དུ་ གནས་པ ར་ བྱ །_།
en: Having given up desire for pleasures and acquisitions, [9.a] They live in the world by pure discipline.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ འོད་སྲུང་ ཆེན་པོ་ ལ་ བཀའ་ སྩལ་པ །_
en: $43 The Blessed One then spoke to Mahākāśyapa:

source: འོད་སྲུང་ ལོངས་ ཤིག _།
en: “Stand up, Kāśyapa.

source: ལོངས་ ལ་ རང་ གི་ སྟན་ ལ་ འདུག་ ཤིག _།
en: Stand up and go take your seat.

source: འོད་སྲུང་ ཁྱོད་ ལ་ ཆོས་ ཀྱི་ ཐེ་ཚོམ་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དྲིས་ ཤིག་ དང་ །_
en: Kāśyapa, whatever doubts you may have about the Dharma, you must bring them before the Thus-Gone One.

source: འོད་སྲུང་ ངས་ དྲིས་པ་ ལན་ བཏབ་པ ས་ ཁྱོད་ ཀྱི་ སེམས་ རངས་པ ར་ བྱ འོ །_།
en: Kāśyapa, I shall answer your questions and delight your mind.”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ འོད་སྲུང་ ཆེན་པོ་ ས འི་ སྟེང་ དེ་ནས་ ལངས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: $44 The venerable Mahākāśyapa then rose from where he had been kneeling, bowed his head to the feet of the Blessed One, and took a place at one side.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཡང་ རྫུ་འཕྲུལ་ ཇི་ལྟ་བུ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་པ ས་ འཛམ་བུ འི་ གླིང་ འདི་ ན་ དགེ་སློང་ དང་ །_ དགེ་སློང་ མ་ དང་ །_ དགེ་བསྙེན་ དང་ །_ དགེ་བསྙེན་མ་ ཇི་སྙེད་ གནས་པ་ དེ་དག་ ཐམས་ཅད་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ |#| ལྷགས་ ནས །_ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ ནས །_
en: Once more the Blessed One performed a miraculous act, so that all the monks and nuns as well as all the male and female lay practitioners in Jambudvīpa now came to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha. |#| They approached the site where the Blessed One was, and as they arrived, they bowed their heads to the Blessed One’s feet and then sat to one side.

source: དགེ་སློང་ དང་ །_ དགེ་སློང་ མ་ དང་ །_ དགེ་བསྙེན་ དང་ །_ དགེ་བསྙེན་མ་ དང་ །_ ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དང་ །_ དྲི་ཟ་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ ནམ་མཁའ་ ལྡིང་ དང་ །_ མི འམ་ ཅི་ དང་ །_ ལྟོ་འཕྱེ་ ཆེན་པོ་ གང་དག་ ཡིན་པ་ དེ་དག་ ཀྱང་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ ར་ ཞུགས་ ཏེ
en: $45 Miraculously, the Blessed One next caused all the monks, nuns, male lay practitioners, female lay practitioners, gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, and mahoragas to enter the Kalandaka­nivāpa in the Veṇuvana and,

source: དེ་དག་ ཞུགས་ ནས་ མཐའ་ ཡ ས་ ཤིང་ དཔག་ ཏུ་ མེད་པར་ ཤེས་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ རྫུ་འཕྲུལ་ མངོན་ པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་ དོ །_།
en: as they entered, this limitless and boundless mass of beings gained insight. |#| The Blessed One then proceeded to perform more miraculous acts.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཡང་ རྫུ་འཕྲུལ་ ཇི་ལྟ་བུ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་པ ས །_ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ རྒྱལ་པོ་ ཆེན་པོ་ བཞི་ དང་ །_ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ དང་ །_ ཚངས་པ་ དང་ །_ ཚངས་ པ་ ཆེན་པོ་ དང་ །_ འོད་གསལ་ དང་ །_ མི་ཆེ་བ་ དང་ །_ མི་གདུང་བ་ དང་ །_ ཤིན་ཏུ་ མཐོང་བ་ དང་ །_ འོག་མིན་ གྱི་ ལྷ འི་ བུ་ ཇི་སྙེད་པ་ དེ་དག་ ཐམས་ཅད་ སངས་རྒྱས་ ཀྱི་ མཐུ ས་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་_ |#| [9b] ལྷགས་ ནས །_ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ ནས །_
en: Thereby, from the entire trichiliocosm, the four great kings, King Śakra of the gods, Brahmā, Mahābrahmā, as well as all the divine sons of the heavens of Luminosity, Unlofty, No Hardship, Excellent Vision, and Unexcelled arrived at the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha due to the power of the Buddha. |#| As they arrived, they proceeded to the place where the Blessed One was residing. [9.b] Having bowed their heads to the Blessed One’s feet, they sat to one side,

source: བཅོམ་ལྡན་འདས་ ལ་ ཐལ་མོ་ སྦྱར་ ཏེ་
en: facing the Blessed One with their palms joined in homage.

source: ཕྱག་ འཚལ་བ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་ དོ་ དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཡང་ རྫུ་འཕྲུལ་ ཇི་ལྟ་བུ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་པ ས །_ ཀླུ འི་ རྒྱལ་པོ་ རྒྱ་མཚོ་ དང་ །_ མ་ དྲོས་པ་ དང་ །_ སྣམ་བུ འི་ དབང་ཕྱུག་ དང་ །_ གཽ་ ཏ་ མ་ དང་ །_ དགའ་བོ་ དང་ །_ ཉེ་དགའ་ དང་ །_ གཟི་ ཅན་ དང་ །_ འཇོག་པོ་ དང་ །_ རབ་ མཛེས་ དང་ །_ ཨེ་ ལ འི་ འདབ་ དང་ །_ དེ་དག་ དང་ གཞན་ ཡང་ ཀླུ་ བྱེ་བ་ ཕྲག་ སྟོང་ སངས་རྒྱས་ ཀྱི་ མཐུ ས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ |#| ལྷགས་ ནས །_ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_ |#| ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ ཅིང་
en: $46 The Blessed One then performed further miraculous acts. |#| Thus, by the power of the Buddha, there now appeared the kings of the nāgas—Sāgara, Anavatapta, Kambaleśvara, Gautama, Nanda , Upananda, Manasvin, Takṣaka, Sundara, and Elapatra—accompanied by a billion other nāgas. |#| They all went before the Blessed One, bowed their heads to his feet in homage, and sat to one side.

source: རྒྱ་ཆེན་པོ འི་ ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དང་ །_ དྲི་ཟ་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ ནམ་མཁའ་ ལྡིང་ དང་ །_ མི འམ་ ཅི་ དང་ །_ ལྟོ་འཕྱེ་ ཆེན་པོ་ དང་ །_ དགེ་སློང་ དང་ །_ དགེ་སློང་ མ་ དང་ །_ དགེ་བསྙེན་ དང་ །_ དགེ་བསྙེན་མ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ སངས་རྒྱས་ ཀྱི་ མཐུ ས་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ ར་ ཞུགས་ ནས་ |#| གཅིག་ ལ་ གཅིག་ ཉམ་ང་བ་ མེད་པ ས་ འཁོད་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་ དོ །_།
en: $47 In this way, by the power of the Buddha, such a vast gathering of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, mahoragas, monks, nuns, and male and female lay practitioners had now come together at the Kalandaka­nivāpa in the Veṇuvana. |#| Everyone entered the grove and took a place there without any anxiety about one another. |#| Such was the Blessed One’s miraculous activity.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ མཽད་གལ་ གྱི་ བུ་ཆེན་པོ་ ལ་ བཀའ་ སྩལ་པ །_
en: $48 The Blessed One now addressed the venerable Maudgalyāyana:

source: མཽད་གལ་ གྱི་ བུ་ ཁྱོད་ ལོངས་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ གདན་ ཤོམས་ ཤིག _།
en: “Maudgalyāyana, stand up and prepare a seat for the Thus-Gone One.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ བཞུགས་ ནས་ |#| ཐེ་ཚོམ་ ཐམས་ཅད་ གཅོད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: Seated there, the Thus-Gone One shall deliver the Dharma discourse known as ‘Cutting Through All Doubts.’

source: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ སྒྲུབ་པ འི་ སྤྱོད་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will display the activity that fulfills the wishes of all sentient beings.

source: སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will deliver a teaching of the Dharma that satisfies all sentient beings.

source: སེམས་ཅན་ ཐམས་ཅད་ ཆོས་ ལ་ ཡང་དག་ པར་ གཞོལ་བ འི་ ཚུལ་ གྱི་ སྒོ་རྒྱ་ མཚོ འི་ ཕྱག་རྒྱ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will reveal the ocean seal that leads all sentient beings to merge with the Dharma.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ བསྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will explain how to accomplish the activities of all bodhisattva great beings. [10.a]

source: སངས་རྒྱས་ [10a] ཀྱི་ ཆོས་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will explain the way to cultivate the qualities of the buddhas.

source: སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ ར་ བྱ་བ་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will explain the practices that bring sentient beings to maturity.

source: སྦྱིན་པ འི་ ཕ་རོལ་ དུ་ ཕྱིན་པ་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར་བ་ ནས །_ |#| ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ སྒྲུབ་པ འི་ བར་ དུ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will explain how to practice transcendent generosity up until transcendent insight.

source: ཆོས་ ཐམས་ཅད་ ཀྱི་ ཚུལ་ གྱི་ སྒོ་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will explain the practice of the door to the way of all phenomena.

source: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དབང་པོ་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར །_
en: He will show the accomplishment of the lord of all beings.

source: སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ གནས་པ འི་ སྤྱོད་པ་ སྒྲུབ་པ་ ཡང་དག་ པར་ སྟོན་པ ར་ ཡང་ འགྱུར །_
en: He will show the accomplishment of the activities pertaining to the states of all beings.

source: འཁོར་ བཞི་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ ར་ འགྱུར །_
en: He will satisfy the four retinues.

source: ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དང་ །_ དྲི་ཟ་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ ནམ་མཁའ་ ལྡིང་ དང་ །_ མི འམ་ ཅི་ དང་ །_ ལྟོ་འཕྱེ་ ཆེན་པོ འི་ འཁོར་ ཡང་ཡང་ དག་པ ར་ ཚིམ་པ ར་ བྱེད་པ ར་ འགྱུར །_
en: He will satisfy the retinue of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, and mahoragas.

source: འདས་པ འི་ དུས་ ལ་མ་ ཆགས་ མ་ཐོགས་པ འི་ ཡེ་ཤེས་ མཐོང་ བ་ དང་ །_ དེ་བཞིན་ དུ་ ད་ལྟ ར་ དང་ །_ མ་འོངས་པ འི་ དུས་ ལ་མ་ ཆགས་ མ་ཐོགས་པ འི་ ཡེ་ཤེས་ མཐོང་བ་ དང་ །_ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ དང་ །_ སྤྱོད་པ་ དང་ །_ སྨོན་ལམ་ རྣམས་ དང་ །_ ཡེ་ཤེས་ ཀྱི་ ཕྱོགས་ ཙམ་ ཞིག་ ཡང་དག་ པར་ སྟོན་པ ར་ འགྱུར་ རོ །_།
en: He will teach just a fraction of the wisdom that is unhindered and unimpeded with regard to past, present, and future. |#| He will teach just a fraction pertaining to the ripening of karmic action, as well as to activity, aspiration, and wisdom.”

source: དེ་ནས་ ཚེ་ དང་ ལྡན་ པ་ མཽད་གལ་ གྱི་ བུ་ཆེན་པོ་ སྟན་ ལས་ ལངས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས །_
en: $49 The venerable Maudgalyāyana rose from his seat and bowed his head to the feet of the Blessed One.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ གདན་ འཕང་ དུ་ ཚངས་པ འི་ འཇིག་རྟེན་ སྲིད་ ཅིག་ བཤམས་ སོ །_།
en: He then emanated a seat for the Blessed One that was as large as the world of Brahmā.

source: སྟེང་ གི་ བར་སྣང་ ལ་ ཡང་ བཅོམ་ལྡན་འདས་ ཀྱི་ འཆག་ས་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ བྱས་པ་ ཀ་ ཙ་ ལིན་ ད འི་ གོས་ ལྟར་ རེག་ ན་ |#| བདེ་བ །_ སྲིད་ ཀྱི་ ཚད་ ནི་ སྟོང་ གི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དང་ ལྡན་པ །_ རྒྱ ར་ ནི་ དཔག་ཚད་ བདུན་ བརྒྱ་ དང་ ལྡན་པ་ ཞིག་ བྱས་ སོ་ འཆག་ས་ དེ་ ལ་ ཡང་ རྩིག་པ་ རིམ་པ་ བདུན་ དང་ །_ རྟ་བབས་ རིམ་པ་ བདུན་ དང་ །_ སྟེགས་བུ་ རིམ་པ་ བདུན་ དང་ །_ དྲིལ་བུ་ གཡེར་ ཀ འི་ དྲ་བ་ རིམ་པ་ བདུན་ གྱིས་ ཀུན་ ནས་ བསྐོར་བ་ སྤྲུལ་ ཏོ །_།
en: In the sky above he emanated a courtyard for the Blessed One made of the seven precious substances that was as smooth to the touch as kācalindika fabric. |#| The courtyard was as vast as a thousandfold universe, and it extended for a distance of seven hundred leagues. |#| Surrounding the courtyard were seven fences, seven arches, seven ledges, and seven layers of lattices made of bells and bangles.

source: འཆག་ས་ དེ འི་ གཡས་གཡོན་ དུ་ ཡང་ འདི་ལྟ་སྟེ །_ |#| གསེར་ དང་ །_ དངུལ་ དང་ །_ ཤེལ་ དང་ །_ བཻ་ དཱུརྱ་ རིན་པོ་ཆེ་ སྣ་ བཞི འི་ ཤིང་ ལྗོན་པ་ དག་ མངོན་པར་ སྤྲུལ་ ཏོ །_།
en: To its sides he emanated trees of four precious substances: gold, silver, crystal, and beryl.

source: གསེར་ ལས་ བྱས་པ འི་ ཤིང་ ལྗོན་པ་ [10b] རྣམས་ ལ་ དངུལ་ གྱི་ ལོ་མ་ དག་ དང་ །_ ཤེལ་ གྱི་ མེ་ཏོག་ དག་ དང་ །_ བཻ་ དཱུརྱ་ ལས་ བྱས་པ འི་ འབྲས་བུ་ དག་ དང་ །_ དངུལ་ ལས་ བྱས་པ འི་ ཤིང་ ལྗོན་པ་ རྣམས་ ལ་ གསེར་ གྱི་ ལོ་མ་ དག་ དང་ །_ བཻ་ དཱུརྱ་ ལས་ བྱས་པ འི་ མེ་ཏོག་ དག་ དང་ །_ ཤེལ་ ལས་ བྱས་པ འི་ འབྲས་བུ་ དག་ དང་ །_ བཻ་ དཱུརྱ་ ལས་ བྱས་པ འི་ ཤིང་ ལྗོན་པ་ རྣམས་ ལ་ གསེར་ གྱི་ ལོ་མ་ དག་ དང་ །_ དངུལ་ གྱི་ མེ་ཏོག་ དག་ དང་ །_ ཤེལ་ གྱི་ འབྲས་བུ་ དག་ དང་ །_ ཤེལ་ ལས་ བྱས་པ འི་ ཤིང་ ལྗོན་པ་ རྣམས་ ལ་ གསེར་ གྱི་ ལོ་མ་ དག་ དང་ །_ དངུལ་ གྱི་ མེ་ཏོག་ དག་ དང་ །_ བཻ་ དཱུརྱ་ ལས་ བྱས་པ འི་ འབྲས་བུ་ དག་ མངོན་ པར་ སྤྲུལ་ ཏོ །_།
en: The trees of gold [10.b] had silver leaves, crystal flowers, and beryl fruits; |#| the trees that were of silver had golden leaves, flowers of beryl, and fruits of crystal; |#| the beryl trees had leaves of gold, flowers of silver, and fruits of crystal; |#| and the crystal trees had leaves of gold, silver flowers, and beryl fruits.

source: ཤིང་ ལྗོན་པ་ ཐམས་ཅད་ ཀྱི་ བར་ དག་ ཏུ་ ཡང་ ཡན་ལག་ བརྒྱད་ དང་ ལྡན་པ འི་ ཆུས་ བཀང་བ འི་ རྫིང་ ཐེམ་སྐས་ བཞི་ དང་ ལྡན་པ །_ ཐེམ་སྐས་ དེ་དག་ ཀྱང་ རིན་པོ་ཆེ་ སྣ་ བཞི་ གསེར་ དང་ །_ དངུལ་ དང་ །_ བཻ་ དཱུརྱ་ དང་ །_ ཤེལ་ ལས་ བྱས་པ །_ གསེར་ གྱི་ ཕྱེ་མ་ བདལ་ བ །_ ཨུད་ པལ་ དང་ །_ པད་མ་ དང་ །_ ཀུ་མུ་ད་ དང་ །_ པད་མ་ དཀར་པོ ས་ ཁེབས་པ །_ སྟེང་ གི་ བར་སྣང་ ལ་ ཡང་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ བྱས་པ འི་ དྲ་བ འི་ བླ་རེ་ བྲེས་པ་ ཞིག་ མངོན་པར་ སྤྲུལ་ ཏོ །_།
en: Between the trees were ponds filled with water endowed with the eight qualities. |#| Leading to the water were four steps, each of them made of precious substances: gold, silver, beryl, and crystal. |#| Sand of gold was strewn, and in the ponds blossomed blue, pink, red, and white lotuses. |#| In the sky above, he emanated a latticed canopy made of the seven precious substances.

source: འཆག་ས་ དེ་ཡང་ དར་ གྱི་ ལྡ་ལྡི་ མང་པོ ས་ སྤྱངས་པ །_ བདུག་སྤོས་ དྲི་ཞིམ་པོ ས་ བདུགས་པ །_ མི་ བདུན་ གྱི་ སྲིད་ ཙམ་ དུ་ མེ་ཏོག་ སྣ་ཚོགས་ ཀྱིས་ གཅལ་ བཀྲམ་པ་ ཞིག་ མངོན་པར་ སྤྲུལ་ ཏོ །_།
en: The courtyard was decorated with numerous silken tassels, the air was filled with pleasant wafts of incense, and there were beds of various flowers, each the size of seven people.

source: ཨུད་པ་ ལ་ དང་ །_ པད་མ་ དང་ །_ ཀུ་མུ་ད་ དང་ །_ པད་མ་ དཀར་པོ་ དེ་དག་ ལ་ ཡང་ མཽད་གལ་ གྱི་ བུ་ དང་ འདྲ་བ འི་ དགེ་སློང་ དག་ མངོན་པར་ སྤྲུལ་ ཏོ །_།
en: Within each of the blue, pink, red, and white lotuses Maudgalyāyana created a monk who looked just like himself.

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ མཽད་གལ་ གྱི་ བུ་ ཆེན་པོ ས་ རྫུ་འཕྲུལ་ གྱིས་ བྱས་པ འི་ གདན་ དེ་ལྟ་ བུ་ དེ་ མངོན་པར་ སྤྲུལ་ ཏེ །_
en: $50 When the venerable Mahā­maudgalyā­yana had magically produced a seat of this sort,

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཐད་ དུ་ ཕྱིན་ ནས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: he went before the Blessed One and said,

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ གདན་ བཤམས་ ལགས་ ན །_ |#| དེ འི་ དུས་ ལ་ དབབ་པ ར་ མཁྱེན་པ ར་ མཛད་ དུ་ གསོལ །_
en: “Blessed One, I have prepared a seat for you. |#| Please know that the time is now right.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚེ་ དང་ ལྡན་པ་ མཽད་གལ་ གྱི་ བུ་ཆེན་པོ་ ལ་ བཀའ་ སྩལ་པ །_
en: the Blessed One then asked,

source: མཽད་གལ་ གྱི་ བུ་ ཁྱོད་ ཀྱིས་ གདན་ བཤམས་ ཟིན་ ཏམ །_
en: $51 “Maudgalyāyana,” |#| “have you finished arranging my seat?”

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ བཤམས་ ལགས་སོ །_།
en: “Yes, Blessed One, I have,” replied Maudgalyāyana.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་ [11a] པོ་ ཡུལ་ མཐའ་ཡས་པ་ ལ་ དམིགས་པ་ སྒྲུབ་པ་ ངེས་པ ར་ སྟོན་པ་ ལ་ བཀའ་ སྩལ་པ །_
en: $52 The Blessed One then addressed the bodhisattva great being [11.a] Revealing the Accomplishment of Apprehending Infinite Objects:

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ འི་ སེང་གེ འི་ ཁྲི་ ཤོམས་ ཤིག _།
en: “Noble son, prepare a lion throne for the Thus-Gone One.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ བཞུགས་ ནས་ |#| སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཡང་དག་ པར་ རབ་ཏུ་ སྟོན་པ ར་ འགྱུར་ རོ །_།
en: Seated upon that throne, the Thus-Gone One shall deliver the Dharma teaching known as ‘Truly Satisfying All Sentient Beings.’ ”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡུལ་ མཐའ་ཡས་པ་ ལ་ དམིགས་པ་ སྒྲུབ་པ་ ངེས་པ ར་ སྟོན་པ ས །_ བཅོམ་ལྡན་འདས་ ཀྱི་ ལྟར་ མཉན་ ནས་ གདན་ བཤམས་ སོ །_།
en: $53 Paying heed to the Blessed One, the bodhisattva great being Revealing the Accomplishment of Apprehending Infinite Objects then prepared a seat, and

source: གདན་ དེ་ ཤོམ་པ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཇི་སྙེད་ འདུས་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱིས་ སེང་གེ འི་ གདན་ དེར་ རང་རང་ གིས་ བླ་གོས་ དག་ བཏིང་ ངོ་ །_།
en: all the bodhisattvas who were in attendance likewise offered their own shawls to the seat, spreading them upon the lion throne.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ འདི་ སྙམ་ དུ་ དགོངས་ ཏེ །_
en: $54 Next the Blessed One formed the following intention:

source: བདག་ གིས་ ནི་ འདི་ལྟ་སྟེ །_ |#| ཐེ་ཚོམ་ དང་ སོམ་ཉི་ བསལ་བ འི་ ཕྱིར་ རྫུ་འཕྲུལ་ མངོན་ པར་ འདུ་ བྱ་བ་ མངོན་པར་ འདུ་ མཛད་པ་ གང་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྤྱད་པ་ བསྒྲུབ་པ་ དང་ །_ འཇུག་པ་ བསྒྲུབ་པ་ དང་ །_ སྨོན་ལམ་ བསྒྲུབ་པ་ དང་ །_ ཞིང་ བཀོད་པ་ བསྒྲུབ་པ་ དང་ །_ སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ ར་ བྱ་བ་ བསྒྲུབ་པ་ གང་དག་ ཡིན་པ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ རྣམས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ བཀོད་པ་ འབྱུང་བ་ དང་ །_ ཉན་ཐོས་ ཕུན་སུམ་ ཚོགས་པ་ འབྱུང་བ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ ཕུན་སུམ་ ཚོགས་པ་ འབྱུང་བ་ དང་ །_ ཆོས་ བསྟན་པ་ ཕུན་ སུམ་ ཚོགས་པ་ འབྱུང་བ་ དང་ །_ ཚེ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ མདོག་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ གཟུགས་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ མཚན་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ དཔེ་བྱད་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ ཡང་དག་པ འི་ སྦྱོར་བ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ དམ་པ འི་ ཆོས་ རབ་ཏུ་ རྣམ་པར་ མི་ འཇིག་པ་ ཕུན་སུམ་ ཚོགས་པ་ འབྱུང་བ་ གང་དག་ ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ རང་རང་ གི་ ཆོས་གོས་ དག་ ལས་ མཐོང་བ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ བྱ་བ་ དེས་ ངེས་པ ར་ མངོན་པར་ འདུ་ བྱ འོ་ སྙམ་ མོ །_།
en: “In order to dispel the doubts and hesitations of these bodhisattvas, I shall produce a miracle. |#| Based on their own Dharma robes, I will grant them a vision of their bodhisattva activities, engagements, aspirations, display of realms, and maturation of sentient beings. |#| I shall let them perceive the features of the realms within which they are to awaken to true and complete buddhahood. |#| Likewise, I shall let them see their perfect hearers, their perfect bodhisattvas, and their perfect Dharma teaching. |#| I shall show them their perfect lifespan, perfect complexion, perfect form, perfect name, perfect marks, perfect endowments, and their perfect Dharma fearlessness.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དྲན་པ་ དང་ མཁྱེན་ [11b] བཞིན་ དུ་ གདན་ དེ་ ལ་ བཞུགས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ གདན་ དེ་ ལ་ བཞུགས་ ནས་ ཀྱང་ ཡུལ་ མཐའ་ཡས་པ་ ལ་ དམིགས་པ་ བསྒྲུབ་པ་ ངེས་པ ར་ སྟོན་པ་ ཞེས་ བྱ་བ་ སངས་རྒྱས་ ཀྱི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: $55 Then, with his wisdom mind thus inclined, the Blessed One sat down upon his seat [11.b] and entered the buddhas’ absorption known as revealing the accomplishment of apprehending infinite objects .

source: དེ་བཞིན་ གཤེགས་པ་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ ནས །_ |#| དེ་ནས་ དེ་ མ་ ཐག་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གིས་ རང་རང་ གི་ བླ་གོས་ ཇི་སྙེད་པ་ དེ་དག་ བཅོམ་ལྡན་འདས་ ཀྱི་ གདན་ དུ་ བཏིང་ ངོ་ །_། |#| དེ་དག་ གིས་ རང་རང་ གི་ ཆོས་གོས་ དེ་དག་ ལ་ བདག་ཉིད་ ཀྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ ཡོན་ཏན་ བཀོད་པ་ ཕུན་སུམ་ ཚོགས་པ་ ནས །_ |#| རབ་ཏུ་ རྣམ་པར་ མི་ འཇིག་པ་ ཕུན་སུམ་ ཚོགས་པ འི་ བར་ དུ་ ཡང་ མཐོང་ ངོ་ །_།
en: As soon as the Blessed One had entered this meditative absorption, all the bodhisattvas who had placed their upper garments upon the Blessed One’s seat now came to perceive everything—from the perfect array of their own future buddha realm up to their perfect Dharma fearlessness—within each of their own shawls.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ཡང་དག་ པར་ ཚིམ་ ཞིང་ ཡི་ རངས་ ཏེ །_
en: Witnessing all this, the bodhisattvas were deeply gratified and delighted.

source: དགའ་བ་ དང་ དང་བ་ ལ་ གནས་ ནས་ |#| བཅོམ་ལྡན་འདས་ ལ་ སྒྲ་ སྐད་ འཐུན་ པར་ ཚིགས་ སུ་ བཅད་ དེ་ |#| བསྟོད་པ །_
en: Joyous and elated, with one voice they sang the following verses to the Blessed One:

source: ཆོ་ག་ སྤྱོད་ པ་ ཡོན་ཏན་ གནས་ གྱུར་པ །_། ཆོས་ རྣམས་ ཀུན་ ལ་ དབང་ལྡན་ བསྙེངས་ མི་ མངའ །_།
en: $56 “O you of proper comportment and conduct, source of excellent qualities, Fearless master of all phenomena—

source: ཡོན་ཏན་ ཀུན་ ལ་ གནས་པ ས་ ཁྱོད་ མཛེས་ ཏེ །_།
en: Endowed with all excellent qualities, how beautiful you are!

source: རྒྱལ་བ་ དབང་ལྡན་ ཏིང་འཛིན་ ཡང་དག་ གནས །_།
en: You are a masterful victor who abides in absorption.

source: གཡོ་ དང་ སྒྱུ་ ནི་ ཁྱོད་ ལ་ ཡོངས་ མི་ མངའ །_།
en: $57 “You are free from falseness and deceit.

source: ང་རྒྱལ་ རྒོད་ དང་ ཚུལ་འཆོས་ མི་ མངའ་ སྟེ །_།
en: Knowing neither pride, agitation, nor pretense,

source: རིག་ དང་ རྣམ་གྲོལ་ དག་ གི་ སྤྱོད་པ་ མཁྱེན །_།
en: You know the deeds related to knowledge and liberation.

source: ཏིང་འཛིན་ དེ་ ལ་ གནས་པ ས་ ཁྱོད་ མཛེས་ སོ །_།
en: Abiding in this meditative absorption, how beautiful you are!

source: དབང་ལྡན་ བསྙེངས་བྲལ་ ཏིང་འཛིན་ གནས་ ནས་ སུ །_། རྫུ་འཕྲུལ་ མི་ མཚུངས་ བླ་ ན་ མེད་པ་ བསྟན །_།
en: $58 “With fearless mastery you remain in meditation And so display unparalleled and unsurpassable miracles.

source: ཆགས་ མེད་ ཡེ་ཤེས་ བསྟན་ ཕྱིར་ དབང་ལྡན་པ །_། མ་འོངས་ དུས་ ནི་ ཁྱོད་ ཀྱིས་ དེང་ བསྟན་ ཏོ །_།
en: Revealing your unhindered wisdom, With mastery, today you have disclosed the future.

source: མི་ གཡོ་ གོ་འཕང་ ཞི་བ་ ཐོབ་ སྙམ་ བགྱིད །_།
en: $59 “We now think we have attained the peace of the immutable stage;

source: དེ་རིང་ བྱང་ཆུབ་ ལ་ ནི་ མཆིས་ སྙམ་ བགྱིད །_།
en: We now think we have entered awakening;

source: བདུད་དཔུང་ བཅས་པ་ རབ་ཏུ་ བཅོམ་ སྙམ་ བགྱིད །_།
en: We now think we have conquered the māras;

source: དེ་རིང་ རིག་པ་ རྗེས་སུ་ ཐོབ་ སྙམ་ བགྱིད །_།
en: We now think we have gained knowledge.

source: རྒྱལ་བས་ གང་ གིས་ འདུས་བྱས་ སྟོང་ གཟིགས་པ འི །_། བླ་མེད་ མིག་ ནི་ ཐོབ་པ ར་ འགྱུར་ སྙམ་ བགྱིད །_།
en: $60 “We now think we have attained the supreme eye With which the victorious ones perceive the voidness of all things conditioned.

source: ཆགས་ མེད་ ཡེ་ཤེས་ ཁྱོད་ ཀྱི་ བཀའ་དྲིན་ ལ །_། མིག་ ཀྱང་ ཆགས་པ་ མཆིས་པ་ ཡོད་ མ་ ལགས །_།
en: By the kindness of your unhindered wisdom The eye sees, utterly unhindered.

source: རྣམ་པར་ མཐོང་ ཡང་ ཅི་ཡང་ མ་ མཐོང་ ཞིང་ །_། ཆོས་ ནི་ གང་ ལ འང་ ཞེ་ འགྲས་ མ་ མཆིས་ ཏེ
en: $61 “While perceiving distinctly, nothing is seen, And no phenomenon is threatening.

source: གང་ ལ་ ཡིད་ ནི་ ཞེ་ འགྲས་ མ་ [12a] མཆིས་པ །_། དེ་ ནི་ སངས་རྒྱས་ སྤྱན་ མཆོག་ དེ་ ལགས་སོ །_།
en: When the mind is free from hostility [12.a] Then that is the supreme buddha eye.

source: ཇི་ལྟ ར་ རྒྱལ་བ འི་ སངས་རྒྱས་ སྤྱན་ མཆོག་ གིས །_། ཁམས་ གསུམ་ ཤེས་ ལ་མ་ ཆགས་ འཇུག་པ་ བཞིན །_།
en: $62 “With the victor’s supreme buddha eye The three realms are known and accessed without any hindrance.

source: དངོས་ དང་ དངོས་མེད་ མཉམ་ མཚུངས་ ཡིད་ དང་ ལྡན །_། |#| ཡང་དག་ བརྩོན་ ཞིང་ རང་ གི་ མིག་ ལ་ གནས །_།
en: With a mind in which entity and non-entity are equal You display true diligence, resting within your own vision.

source: གང་ ཚེ་ རྒྱལ་བ་ ཏིང་འཛིན་ དེར་ གནས་ ཏེ །_། |#| དེ་རིང་ དེ་དག་ ཀུན་ གྱིས་ ཐོབ་ སྙམ་ བགྱིད །_།
en: $63 “When the Victorious One entered this absorption, He made everyone feel that they had gained accomplishment.#11
